[
    {
      "id": 1,
      "categoryId": 1,
      "title": "Advance Website Development",
      "description": "As a jack of all trades (and master of quite a few), a full-stack engineer can get a project done from start to finish. In this Career Path, you’ll begin with the front-end, move on to the back-end, then learn to connect the two. By the time you’re done, you’ll have the well-rounded skills needed to enter this in-demand job market.",
      "price": 5000,
      "duration": 30,
      "image": "https://www.sapphirewebsolutions.com/wp-content/uploads/2019/09/Web-Development-Trends.jpg",
      "rating": {
        "rate": 3.9,
        "count": 120
      }
    },
    {
      "id": 2,
      "categoryId": 1,
      "title": "Certificate in PHP",
      "description": "The course starts with the fundamentals and it’ll show you insider tips to work quickly and efficiently with web technologies. Once you’ve got that locked down, you’ll know how to build your own responsive websites using latest techniques. By then you’ll be developing websites, and learn smart ways to add dynamic content As we all know, the best way to learn is to do, so you’ll complete fun website challenges at every turn. Plus, as you fly through the course, you’ll use your skills to put a site together as you go. The final challenge is a full project.",
      "price": 4500,
      "duration": 30,
      "image": "https://miro.medium.com/max/750/0*zqNMYY5rMsu6jJCP.jpg",
      "rating": {
        "rate": 3.9,
        "count": 120
      }
    },
    {
      "id": 3,
      "categoryId": 2,
      "title": "Graphic design",
      "description": "Graphic design is all around us, in a myriad of forms, both on screen and in print, yet it is always made up of images and words to create a communication goal. This four-course sequence exposes students to the fundamental skills required to make sophisticated graphic design: process, historical context, and communication through image-making and typography. The sequence is completed by a capstone project that applies the skills of each course and peer feedback in a finished branding project suitable for a professional portfolio.",
      "price": 5000,
      "duration": 30,
      "image": "https://www.reliablesoft.net/wp-content/uploads/2021/10/best-graphic-design-courses.webp",
      "rating": {
        "rate": 3.9,
        "count": 120
      }
    },
    {
      "id": 4,
      "categoryId": 2,
      "title": "Multimedia And Animation Designing",
      "description": "Computer graphics can be a powerful tool for supporting visual problem solving, and interactivity plays a central role in harnessing the users' creativity. This course will introduce various interactive tools developed in computer graphics research field with their design rationales and algorithms. Examples include enhancements to graphical user interfaces, authoring tools for 2D drawings and 3D animations, and interactive computer-aided design systems. Rich live demonstrations and course assignments will give you insights and skills to design and implement such tools for your own problems.",
      "price": 5000,
      "duration": 30,
      "image": "https://s3.amazonaws.com/designco-web-assets/uploads/2019/02/Animation-Handbook-05.png",
      "rating": {
        "rate": 3.9,
        "count": 120
      }
    },
    {
      "id": 5,
      "categoryId": 3,
      "title": "Digital Marketing",
      "description": "Welcome to the Digital Marketing Institute’s foundational program on Digital Marketing Strategy. The DMI is the global standard in Digital Marketing Certification. If you are seeking to understand the forces that are driving and transforming businesses today and how an effective digital strategy can help a business to grow and thrive in this dynamic environment, this program will help you do so.",
      "price": 5000,
      "duration": 30,
      "image": "https://www.hillarysmarkets.com/wp-content/uploads/2021/12/Digital-Marketing.jpg",
      "rating": {
        "rate": 3.9,
        "count": 120
      }
    },
    {
      "id": 6,
      "categoryId": 3,
      "title": "Certificate in SEO",
      "description": "This Specialization will teach you to optimize website content for the best possible search engine ranking. You'll learn the theory behind Google search and other search engine algorithms; you'll also build practical, real-world skills that you can apply to a career in digital marketing or online content development, including on-page and off-page optimization, optimizing for local and international audiences, conducting search-focused website audits, and aligning SEO with overall business strategies. Each course is intended to build on the skills from the previous course, thus we recommend you take the courses in the order they are listed. The Specialization culminates in a hands-on Capstone Project, in which you will apply your skills to a comprehensive SEO consulting task. ",
      "price": 5000,
      "duration": 30,
      "image": "https://mangools.com/blog/wp-content/uploads/2019/07/learn-seo-new-featured.png",
      "rating": {
        "rate": 3.9,
        "count": 120
      }
    },
    {
      "id": 7,
      "categoryId": 4,
      "title": "Basic computer Concept",
      "description": "This specialization is for anyone interested in learning more about computer programming,fundamental computer science knowledge and skills required for work in this field. Through 4 courses in this Specialization you' develop a foundation in the fundamentals of programming, including knowledge and skills essential for a career information technology and data science.",
      "price": 1000,
      "duration": 30,
      "image": "https://digitalmarketingdeal.com/blog/wp-content/uploads/2019/12/What-is-a-computer.jpg",
      "rating": {
        "rate": 3.9,
        "count": 120
      }
    },
    {
      "id": 8,
      "categoryId": 5,
      "title": "blockchain-development",
      "description": "Learn the fundamentals of the blockchain platform. Create your own private blockchain, and secure a digital asset using blockchain identity. Explore the Ethereum platform, and use Solidity and smart contracts to develop your own decentralized app.",
      "price": 5000,
      "duration": 30,
      "image": "https://blog.sagipl.com/wp-content/uploads/2017/11/blockchain-development.png",
      "rating": {
        "rate": 3.9,
        "count": 120
      }
    }
  ]